ruby/J.org
#+TITLE:     J
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>

* [[https://wordsinasentence.com/jaded-in-a-sentence/][Jaded]]

  =depleted of excitement and enthusiasm, usually after having had too much of something=

  - After being on an airplane for nearly twenty-four hours, Henry is a bit jaded and never wants to travel again.
  - Ever since I started working late every night, I have become more and more jaded by the thought of becoming a manager with this company.
  - The world is so jaded by violence that people are starting to feel unsafe outside their homes.
  - Because I have eaten nothing but noodles for the past two weeks, my taste buds are a bit jaded.
  - A number of people have stopped watching television because they have become jaded by the presence of reality shows on every channel.
  - Because many children play video games regularly, they are often jaded by violence in the real world.
  - The celebrity was jaded by the media after been in the public eye for over thirty years.



* [[https://wordsinasentence.com/jeopardize-in-a-sentence/][Jeopardize]]

  =to put at risk=

  - Do not jeopardize your good grade by failing to turn in your assignment.
  - Since I do not want to jeopardize my employment, I always complete my daily goals.
  - The building of the factory near the lake might jeopardize the water’s ecosystem.
  - When questioned about the investigation, the detective refused to say anything because he did not want to jeopardize the case.
  - During his speech, the president vowed he would never jeopardize the country’s safety by cutting the military budget.
  - James is going to jeopardize his job if he does not start arriving to work on time.
  - If you do not follow the safety instructions, you will jeopardize your health.



* [[https://wordsinasentence.com/jest-in-a-sentence/][Jest]]

  =words that are spoken as humor=

  - When confronted by the teacher, the student said his words were in jest and not meant to be taken seriously.
  - I only spoke in jest so please forgive me for hurting your feelings.
  - While Jim made the statement in jest, his stern boss did not welcome his inappropriate humor.
  - My serious father did not appreciate the words I said in jest.
  - Since we know Mark loves his wife, we take his rude remarks about her in jest.
  - The strict judge warned the witness about making statements in jest while giving testimony.
  - When Thad made his remark in jest, he had no idea his coworker would view the joke as sexual harassment.



* [[https://wordsinasentence.com/jocular-in-a-sentence/][Jocular]]

  =characterized by joking; humorous or playful=

  - The jocular man is known for his funny punchlines.
  - Her jocular personality always made the customers smile.
  - You could tell by his serious tone of voice that he wasn't in a jocular mood.
  - Hoping to ease up the audience, the host tried being a little more jocular by telling jokes.
  - As jocular as you are, I'm surprised you aren't a Vegas comedian yet!
  -  I am in a bad mood, so save your jocular 'Your Momma Jokes' for another day!
  - Cheer up your mother by telling a jocular childhood story.



* [[https://wordsinasentence.com/jolt-in-a-sentence/][Jolt]]

  =to push or shake abruptly and roughly=

  - We hope that the new stores opening in the downtown will help jolt the economy back to life.
  - The sudden jolt of electricity shocked Pat back to life as she was being rushed to the hospital.
  - The alarm sounded at five in the morning, waking me up with a jolt.
  - Wendy felt a sudden jolt just after she made a right turn onto Brown Street, making her suspect that a tire had blown out.



* [[https://wordsinasentence.com/jubilant-in-a-sentence/][Jubilant]]

  =filled with joy=

  - I am jubilant to learn that my sister is finally having a baby.
  - Crissy could not control her jubilant emotions after winning the lottery.
  - Laughing always puts me in a jubilant mood.
  - Happy and jubilant as ever, the little boy read off his Christmas wish list to Santa Clause.
  - Lost for hours, the girl finally made found her way back home, leaving the community cheerful and jubilant.
  - All I could do was my jubilant dance after finding out that I don't have cancer!
  - A horror film is suddenly not so scary when you switch in jubilant music.



