ruby/J.html
<!DOCTYPE html>
<html>
<head>
<title>J</title>
<!-- 2018-06-10 Sun 22:07 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">J</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Jaded</a></li>
<li><a href="#sec-2">2. Jeopardize</a></li>
<li><a href="#sec-3">3. Jest</a></li>
<li><a href="#sec-4">4. Jocular</a></li>
<li><a href="#sec-5">5. Jolt</a></li>
<li><a href="#sec-6">6. Jubilant</a></li>
<li><a href="#sec-7">7. Judicious</a></li>
<li><a href="#sec-8">8. Jumble</a></li>
<li><a href="#sec-9">9. Juncture</a></li>
<li><a href="#sec-10">10. Juvenile</a></li>
<li><a href="#sec-11">11. Jabber</a></li>
<li><a href="#sec-12">12. Jagged</a></li>
<li><a href="#sec-13">13. Jarring</a></li>
<li><a href="#sec-14">14. Jaundiced</a></li>
<li><a href="#sec-15">15. Jaunt</a></li>
<li><a href="#sec-16">16. Jaunty</a></li>
<li><a href="#sec-17">17. Jeer</a></li>
<li><a href="#sec-18">18. Jejune</a></li>
<li><a href="#sec-19">19. Jeopardy</a></li>
<li><a href="#sec-20">20. Jettison</a></li>
<li><a href="#sec-21">21. Jibe</a></li>
<li><a href="#sec-22">22. Jockey</a></li>
<li><a href="#sec-23">23. Jocund</a></li>
<li><a href="#sec-24">24. Jostle</a></li>
<li><a href="#sec-25">25. Jovial</a></li>
<li><a href="#sec-26">26. Judicial review</a></li>
<li><a href="#sec-27">27. Junction</a></li>
<li><a href="#sec-28">28. Jurisdiction</a></li>
<li><a href="#sec-29">29. Juxtaposition</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Jaded</a></li>
<li><a href="#sec-2">2. Jeopardize</a></li>
<li><a href="#sec-3">3. Jest</a></li>
<li><a href="#sec-4">4. Jocular</a></li>
<li><a href="#sec-5">5. Jolt</a></li>
<li><a href="#sec-6">6. Jubilant</a></li>
<li><a href="#sec-7">7. Judicious</a></li>
<li><a href="#sec-8">8. Jumble</a></li>
<li><a href="#sec-9">9. Juncture</a></li>
<li><a href="#sec-10">10. Juvenile</a></li>
<li><a href="#sec-11">11. Jabber</a></li>
<li><a href="#sec-12">12. Jagged</a></li>
<li><a href="#sec-13">13. Jarring</a></li>
<li><a href="#sec-14">14. Jaundiced</a></li>
<li><a href="#sec-15">15. Jaunt</a></li>
<li><a href="#sec-16">16. Jaunty</a></li>
<li><a href="#sec-17">17. Jeer</a></li>
<li><a href="#sec-18">18. Jejune</a></li>
<li><a href="#sec-19">19. Jeopardy</a></li>
<li><a href="#sec-20">20. Jettison</a></li>
<li><a href="#sec-21">21. Jibe</a></li>
<li><a href="#sec-22">22. Jockey</a></li>
<li><a href="#sec-23">23. Jocund</a></li>
<li><a href="#sec-24">24. Jostle</a></li>
<li><a href="#sec-25">25. Jovial</a></li>
<li><a href="#sec-26">26. Judicial review</a></li>
<li><a href="#sec-27">27. Junction</a></li>
<li><a href="#sec-28">28. Jurisdiction</a></li>
<li><a href="#sec-29">29. Juxtaposition</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-06-10 22:07:15</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/jaded-in-a-sentence/">Jaded</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>depleted of excitement and enthusiasm, usually after having had too much of something</code>
</p>

<ul class="org-ul">
<li>After being on an airplane for nearly twenty-four hours, Henry is a bit jaded and never wants to travel again.
</li>
<li>Ever since I started working late every night, I have become more and more jaded by the thought of becoming a manager with this company.
</li>
<li>The world is so jaded by violence that people are starting to feel unsafe outside their homes.
</li>
<li>Because I have eaten nothing but noodles for the past two weeks, my taste buds are a bit jaded.
</li>
<li>A number of people have stopped watching television because they have become jaded by the presence of reality shows on every channel.
</li>
<li>Because many children play video games regularly, they are often jaded by violence in the real world.
</li>
<li>The celebrity was jaded by the media after been in the public eye for over thirty years.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/jeopardize-in-a-sentence/">Jeopardize</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>to put at risk</code>
</p>

<ul class="org-ul">
<li>Do not jeopardize your good grade by failing to turn in your assignment.
</li>
<li>Since I do not want to jeopardize my employment, I always complete my daily goals.
</li>
<li>The building of the factory near the lake might jeopardize the water’s ecosystem.
</li>
<li>When questioned about the investigation, the detective refused to say anything because he did not want to jeopardize the case.
</li>
<li>During his speech, the president vowed he would never jeopardize the country’s safety by cutting the military budget.
</li>
<li>James is going to jeopardize his job if he does not start arriving to work on time.
</li>
<li>If you do not follow the safety instructions, you will jeopardize your health.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/jest-in-a-sentence/">Jest</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>words that are spoken as humor</code>
</p>

<ul class="org-ul">
<li>When confronted by the teacher, the student said his words were in jest and not meant to be taken seriously.
</li>
<li>I only spoke in jest so please forgive me for hurting your feelings.
</li>
<li>While Jim made the statement in jest, his stern boss did not welcome his inappropriate humor.
</li>
<li>My serious father did not appreciate the words I said in jest.
</li>
<li>Since we know Mark loves his wife, we take his rude remarks about her in jest.
</li>
<li>The strict judge warned the witness about making statements in jest while giving testimony.
</li>
<li>When Thad made his remark in jest, he had no idea his coworker would view the joke as sexual harassment.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/jocular-in-a-sentence/">Jocular</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>characterized by joking; humorous or playful</code>
</p>

<ul class="org-ul">
<li>The jocular man is known for his funny <b>punchlines</b> <code>妙语</code>.
</li>
<li>Her jocular personality always made the customers smile.
</li>
<li>You could tell by his serious tone of voice that he wasn't in a jocular mood.
</li>
<li>Hoping to ease up the audience, the host tried being a little more jocular by telling jokes.
</li>
<li>As jocular as you are, I'm surprised you aren't a Vegas comedian yet!
</li>
<li>I am in a bad mood, so save your jocular 'Your Momma Jokes' for another day!
</li>
<li>Cheer up your mother by telling a jocular childhood story.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/jolt-in-a-sentence/">Jolt</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>to push or shake abruptly and roughly</code>
</p>

<ul class="org-ul">
<li>We hope that the new stores opening in the downtown will help jolt the economy back to life.
</li>
<li>The sudden jolt of electricity shocked Pat back to life as she was being rushed to the hospital.
</li>
<li>The alarm sounded at five in the morning, waking me up with a jolt.
</li>
<li>Wendy felt a sudden jolt just after she made a right turn onto Brown Street, making her suspect that a tire had blown out.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/jubilant-in-a-sentence/">Jubilant</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>filled with joy</code>
</p>

<ul class="org-ul">
<li>I am jubilant to learn that my sister is finally having a baby.
</li>
<li>Crissy could not control her jubilant emotions after winning the lottery.
</li>
<li>Laughing always puts me in a jubilant mood.
</li>
<li>Happy and jubilant as ever, the little boy read off his Christmas wish list to Santa Clause.
</li>
<li>Lost for hours, the girl finally made found her way back home, leaving the community cheerful and jubilant.
</li>
<li>All I could do was my jubilant dance after finding out that I don't have cancer!
</li>
<li>A horror film is suddenly not so scary when you switch in jubilant music.
</li>
</ul>
</div>
</div>
