ruby/J.org
* [[https://wordsinasentence.com/jeer-in-a-sentence/][Jeer]]

  =ridicule, taunt, scoff at=

  - When the basketball bounced off the rim for the second time, Nolan knew that the crowd would probably jeer at him.
  - Before the assembly, the principal told the student body that anyone who chose to jeer the speaker would be suspended for three days.
  - If only everyone were as willing to cheer their fellow man as they are to jeer at him, the world would be a much better place.
  - Although the two wrestlers are good friends when they’re out of the public eye, they jeer each other mercilessly when they are publicizing an upcoming match.
  - My daughter had some twisted idea that her friends would jeer her if she joined the band, so she let her musical talent go to waste.
  - If you continue to jeer me for trying exotic recipes now and then, you can do the cooking.
  - After their disastrous double blind date, John and Richard headed to their favorite bar to jeer each other over a couple of beers.



* [[https://wordsinasentence.com/jejune-in-a-sentence/][Jejune]]

  =unsophisticated=

  - The billionaire couple refused to eat the jejune dish of chicken wings and tater tots.
  - Although Evan behaved in a jejune manner at the dinner party, he actually teaches international customs at a school for diplomats.
  - I am very jejune and refuse to eat anything I cannot spell.
  - While my peers laughed at my dress and called it jejune, my instructor gave my design the highest grade in the class.


* [[https://wordsinasentence.com/jeopardy-in-a-sentence/][Jeopardy]]

  =at risk of loss or harm=

  - If you do not take your medicine, you will put your health in jeopardy.
  - Do you not care that you are placing your home in jeopardy by making it a part of your gambling wager?
  - Taking such a financial risk could put your retirement income in jeopardy.
  - Because the athlete has been arrested twice on domestic abuse charges, his position on the team is now  in jeopardy.



* [[https://wordsinasentence.com/jettison-in-a-sentence/][Jettison]]

  =to eliminate something=

  - In order to conserve fuel, the pilot was forced to jettison some of his passengers’ suitcases.
  - The company president’s decision to jettison most of the workforce was made in order to save the business from bankruptcy.
  - Because the new stroller is not selling well, the company has decided to jettison it from their product line.
  - Keep the good memories in your heart and jettison the bad ones.
  - Since the current conduct policy is not showing positive results, the principal has decided to jettison the plan and design a new system.
  - The pilot will jettison the bombs as soon as the plane is over the target area.
  - To run a successful hotel, staff members should jettison the idea of simply selling rooms and focus on creating lasting relationships with customers.



* [[https://wordsinasentence.com/jibe-in-a-sentence/][Jibe]]

  =to agree; harmonize=

  - The findings of the court did not jibe with the testimony of the witness, angering the judge.
  - When I interview a candidate for a position in my company, I try to find out if he or she will jibe with the others who work in the office.
  - Our teacher’s style did not jibe well with the students, causing the parent body to request that the school find someone new.
  - The manager stressed that customer’s perceptions of the deals offered in the store do not always jibe with reality.



* [[https://wordsinasentence.com/jockey-in-a-sentence/][Jockey]]

  =one who rides racehorses competitively=

  - Jockeys must be brave to ride horses at high speeds in such tight quarters.
  - The less a jockey weighs, the faster his horse can run.
  - I cannot be a jockey because horse racing is too dangerous for me.
  - A horse jockey’s uniform is called “silks” or “colors” and is usually designed by the horse’s owner.



* [[https://wordsinasentence.com/jocund-in-a-sentence/][Jocund]]

  =in high spirits; cheery=

  - Because Patrick was feeling quite jocund after drinking a few beers, he could not stop smiling.
  - The jocund song put everyone in a happy frame of mind.
  - As soon as I walked towards the front door of the luxury hotel, a jocund doorman greeted me with a smile.
  - The balloons changed the sick little girl’s gloomy mood to a jocund one.
  - Since Cara always appears to have a jocund outlook on life, she surprised everyone when she mentioned her battle with depression.
  - The soldiers were jocund as they stepped off the plane and into the arms of their waiting families.
  - With jocund steps, the defendant exited the courthouse after being found not guilty of all charges.



* [[https://wordsinasentence.com/jolt-in-a-sentence/][Jolt]]

  =to push or shake abruptly and roughly=

  - We hope that the new stores opening in the downtown will help jolt the economy back to life.
  - The sudden jolt of electricity shocked Pat back to life as she was being rushed to the hospital.
  - The alarm sounded at five in the morning, waking me up with a jolt.
  - Wendy felt a sudden jolt just after she made a right turn onto Brown Street, making her suspect that a tire had blown out.



* [[https://wordsinasentence.com/jostle-in-a-sentence/][Jostle]]

  =to compete or struggle for something=

  - As soon as the coach makes the announcement, the football players will start to jostle for the position of team captain.
  - The competing banks jostle to get new customers.
  - In the cafeteria, the students rush through the lines and jostle to get the best tables near the windows.
  - The reality show contestants will jostle to win a million dollars.
  - During the winter, the animals jostle for the limited food resources.
  - On the battlefield, the knights will jostle for the affections of the king’s daughter.
  - Whenever the famous actor dines in our restaurant, the servers jostle to see who can wait on him and earn a nice tip.


* [[https://wordsinasentence.com/jovial-in-a-sentence/][Jovial]]

  =warm and friendly=

  - Stories describe Santa Claus as a jovial man who gives toys to children.
  - During the game, the winning team’s fans were jovial and bought drinks for everyone in the bar.
  - It is hard to make friends if you do not have a jovial personality that sends out welcoming vibes.
  - Because Janet was not jovial at her party, many guests left early.
  - The cruise director is a jovial woman who tries to befriend everyone on the ship.
  - Unlike many actors, Robert is always in a jovial mood and never fails to greet his fans with a warm smile.
  - The jovial hostess made us feel at home as soon as we walked into the restaurant.



