ruby/J.html



<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/jeer-in-a-sentence/">Jeer</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>ridicule, taunt, scoff at</code>
</p>

<ul class="org-ul">
<li>When the basketball <b>bounced off the rim</b> for the second time, Nolan knew that the crowd would probably jeer at him.
</li>
<li>Before the assembly, the principal told the student body that anyone who chose to jeer the speaker would be suspended for three days.
</li>
<li>If only everyone were as willing to cheer their fellow man as they are to jeer at him, the world would be a much better place.
</li>
<li>Although the two wrestlers are good friends when they’re out of the public eye, they jeer each other mercilessly when they are publicizing an upcoming match.
</li>
<li>My daughter had some twisted idea that her friends would jeer her if she joined the band, so she let her musical talent go to waste.
</li>
<li>If you continue to jeer me for trying exotic recipes now and then, you can do the cooking.
</li>
<li>After their disastrous double blind date, John and Richard headed to their favorite bar to jeer each other over a couple of beers.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/jejune-in-a-sentence/">Jejune</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>unsophisticated</code>
</p>

<ul class="org-ul">
<li>The billionaire couple refused to eat the jejune dish of chicken wings and tater tots.
</li>
<li>Although Evan behaved in a jejune manner at the dinner party, he actually teaches international customs at a school for diplomats.
</li>
<li>I am very jejune and refuse to eat anything I cannot spell.
</li>
<li>While my peers laughed at my dress and called it jejune, my instructor gave my design the highest grade in the class.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/jeopardy-in-a-sentence/">Jeopardy</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>at risk of loss or harm</code>
</p>

<ul class="org-ul">
<li>If you do not take your medicine, you will put your health in jeopardy.
</li>
<li>Do you not care that you are placing your home in jeopardy by making it a part of your gambling wager?
</li>
<li>Taking such a financial risk could put your retirement income in jeopardy.
</li>
<li>Because the athlete has been arrested twice on domestic abuse charges, his position on the team is now  in jeopardy.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/jettison-in-a-sentence/">Jettison</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>to eliminate something</code>
</p>

<ul class="org-ul">
<li>In order to conserve fuel, the pilot was forced to jettison some of his passengers’ suitcases.
</li>
<li>The company president’s decision to jettison most of the workforce was made in order to save the business from bankruptcy.
</li>
<li>Because the new <b>stroller</b> is not selling well, the company has decided to jettison it from their product line.
</li>
<li>Keep the good memories in your heart and jettison the bad ones.
</li>
<li>Since the current conduct policy is not showing positive results, the principal has decided to jettison the plan and design a new system.
</li>
<li>The pilot will jettison the bombs as soon as the plane is over the target area.
</li>
<li>To run a successful hotel, staff members should jettison the idea of simply selling rooms and focus on creating lasting relationships with customers.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/jibe-in-a-sentence/">Jibe</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>to agree; harmonize</code>
</p>

<ul class="org-ul">
<li>The findings of the court did not jibe with the testimony of the witness, angering the judge.
</li>
<li>When I interview a candidate for a position in my company, I try to find out if he or she will jibe with the others who work in the office.
</li>
<li>Our teacher’s style did not jibe well with the students, causing the <b>parent body</b> <code>上级机构</code> to request that the school find someone new.
</li>
<li>The manager stressed that customer’s perceptions of the deals offered in the store do not always jibe with reality.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/jockey-in-a-sentence/">Jockey</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>one who rides racehorses competitively</code>
</p>

<ul class="org-ul">
<li>Jockeys must be brave to ride horses at high speeds in such tight quarters.
</li>
<li>The less a jockey weighs, the faster his horse can run.
</li>
<li>I cannot be a jockey because horse racing is too dangerous for me.
</li>
<li>A horse jockey’s uniform is called “silks” or “colors” and is usually designed by the horse’s owner.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/jocund-in-a-sentence/">Jocund</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>in high spirits; cheery</code>
</p>

<ul class="org-ul">
<li>Because Patrick was feeling quite jocund after drinking a few beers, he could not stop smiling.
</li>
<li>The jocund song put everyone <b>in a happy frame of mind</b>.
</li>
<li>As soon as I walked towards the front door of the luxury hotel, a jocund doorman greeted me with a smile.
</li>
<li>The balloons changed the sick little girl’s gloomy mood to a jocund one.
</li>
<li>Since Cara always appears to have a jocund outlook on life, she surprised everyone when she mentioned her battle with depression.
</li>
<li>The soldiers were jocund as they stepped off the plane and into the arms of their waiting families.
</li>
<li>With jocund steps, the defendant exited the courthouse after being found not guilty of all charges.
</li>
</ul>
</div>
</div>





<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/jostle-in-a-sentence/">Jostle</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>to compete or struggle for something</code>
</p>

<ul class="org-ul">
<li>As soon as the coach makes the announcement, the football players will start to jostle for the position of team captain.
</li>
<li>The competing banks jostle to get new customers.
</li>
<li>In the cafeteria, the students rush through the lines and jostle to get the best tables near the windows.
</li>
<li>The reality show contestants will jostle to win a million dollars.
</li>
<li>During the winter, the animals jostle for the limited food resources.
</li>
<li>On the battlefield, the knights will jostle for the affections of the king’s daughter.
</li>
<li>Whenever the famous actor dines in our restaurant, the servers jostle to see who can wait on him and earn a nice tip.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/jovial-in-a-sentence/">Jovial</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>warm and friendly</code>
</p>

<ul class="org-ul">
<li>Stories describe Santa Claus as a jovial man who gives toys to children.
</li>
<li>During the game, the winning team’s fans were jovial and bought drinks for everyone in the bar.
</li>
<li>It is hard to make friends if you do not have a jovial personality that sends out welcoming <b>vibes</b>.
</li>
<li>Because Janet was not jovial at her party, many guests left early.
</li>
<li>The cruise director is a jovial woman who tries to befriend everyone on the ship.
</li>
<li>Unlike many actors, Robert is always in a jovial mood and never fails to greet his fans with a warm smile.
</li>
<li>The jovial hostess made us feel at home as soon as we walked into the restaurant.
</li>
</ul>
</div>
</div>
