ruby/J.org
* [[https://wordsinasentence.com/judicial-review-in-a-sentence/][Judicial review]]

  =a high courts review of a ruling by a lower court or actions of the legislative branch=

  - During the judicial review, the judge considered all of the evidence that had been presented to the lower court judge.
  - A judicial review was ordered so that the judge could be sure that the foreclosures were carried out legally.
  - While a high-court judicial review is conducted, the pipeline project will be postponed.
  - During the judicial review, former cases were cited to help the judge make a decision.



* [[https://wordsinasentence.com/junction-in-a-sentence/][Junction]]

  =a location where roads or lines intersect or meet=

  - The city’s main interstates meet at the area known as Spaghetti Junction.
  - In the junction box, you’ll find the interchange where the electric wires cross over each other.
  - The red light at the junction of Fifth and Main is where the accident occurred.
  - Since Ann believes in the supernatural, she thinks it’s possible to summon a demon at the junction between the church and the cemetery.



* [[https://wordsinasentence.com/jurisdiction-in-a-sentence/][Jurisdiction]]

  =the valid power to make official decisions and rulings=

  - The probate court has jurisdiction over the validity of wills.
  - Since the crime took place in China, the Chinese government has jurisdiction of the case.
  - Our state police do not have jurisdiction to follow the criminals into another state.
  - When the federal judge overturned the decision, he cited the lower court's lack of jurisdiction as part of his reasoning.



* [[https://wordsinasentence.com/juxtaposition-in-a-sentence/][Juxtaposition]]

  =the fact of two things being seen or placed closed together with contrasting effect=

  - The reality clearly shows a cultural juxtaposition between rich people and poor people.
  - What impressed me most about the song was its juxtaposition of country and classic soul.
  - Because my husband and I have never had a dish composed of both Mexican and Italian foods, we were eager to see the juxtaposition the waitress would place in front of us.
  - The director’s latest film deals with the juxtaposition of love and hate and how the two emotions relate to each other.
  - Even the art critic was shocked by the juxtaposition of the two art styles in one portrait.
  - The juxtaposition of the comic books next to the philosophical journals made Jim’s library quite unique.
  - Although I am not a cookie lover, I am intrigued enough by the juxtaposition of the black and white icing to try a Half-Moon cookie.




#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>