ruby/J.html



<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/judicial-review-in-a-sentence/">Judicial review</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>a high courts review of a ruling by a lower court or actions of the legislative branch</code>
</p>

<p>
<code>司法审查</code>
</p>

<ul class="org-ul">
<li>During the judicial review, the judge considered all of the evidence that had been presented to the lower court judge.
</li>
<li>A judicial review was ordered so that the judge could be sure that the foreclosures were carried out legally.
</li>
<li>While a high-court judicial review is conducted, the pipeline project will be postponed.
</li>
<li>During the judicial review, former cases were cited to help the judge make a decision.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/junction-in-a-sentence/">Junction</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>a location where roads or lines intersect or meet</code>
</p>

<ul class="org-ul">
<li>The city’s main interstates meet at the area known as Spaghetti Junction.
</li>
<li>In the junction box, you’ll find the interchange where the electric wires cross over each other.
</li>
<li>The red light at the junction of Fifth and Main is where the accident occurred.
</li>
<li>Since Ann believes in the supernatural, she thinks it’s possible to summon a demon at the junction between the church and the cemetery.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/jurisdiction-in-a-sentence/">Jurisdiction</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>the valid power to make official decisions and rulings</code>
</p>

<ul class="org-ul">
<li>The probate court has jurisdiction over the validity of wills.
</li>
<li>Since the crime took place in China, the Chinese government has jurisdiction of the case.
</li>
<li>Our state police do not have jurisdiction to follow the criminals into another state.
</li>
<li>When the federal judge overturned the decision, he cited the lower court's lack of jurisdiction as part of his reasoning.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/juxtaposition-in-a-sentence/">Juxtaposition</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>the fact of two things being seen or placed closed together with contrasting effect</code>
</p>

<ul class="org-ul">
<li>The reality clearly shows a cultural juxtaposition between rich people and poor people.
</li>
<li>What impressed me most about the song was its juxtaposition of country and classic soul.
</li>
<li>Because my husband and I have never had a dish composed of both Mexican and Italian foods, we were eager to see the juxtaposition the waitress would place in front of us.
</li>
<li>The director’s latest film deals with the juxtaposition of love and hate and how the two emotions relate to each other.
</li>
<li>Even the art critic was shocked by the juxtaposition of the two art styles in one portrait.
</li>
<li>The juxtaposition of the comic books next to the philosophical journals made Jim’s library quite unique.
</li>
<li>Although I am not a cookie lover, I am intrigued enough by the juxtaposition of the black and white icing to try a Half-Moon cookie.
</li>
</ul>




<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>